I ran this against a table and it produced this plan.

```
  # module.dynamodb_table.aws_dynamodb_table.default[0] must be replaced
-/+ resource "aws_dynamodb_table" "default" {
      ~ arn                         = "arn:aws:dynamodb:us-east-1:1234567890:table/ns-x-y-z-my-table" -> (known after apply)
      ~ id                          = "ns-x-y-z-my-table" -> (known after apply)
        name                        = "ns-x-y-z-my-table"
      ~ read_capacity               = 0 -> (known after apply)
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
        tags                        = {
            "Environment" = "ue1"
            "Name"        = "ns-x-y-z-my-table"
            "Namespace"   = "sm"
            "Stage"       = "dev"
            "Tenant"      = "data"
        }
      ~ write_capacity              = 0 -> (known after apply)
        # (5 unchanged attributes hidden)

      + import_table {
          + input_compression_type = "GZIP"
          + input_format           = "DYNAMODB_JSON"

          + s3_bucket_source { # forces replacement
              + bucket     = "dynamodb-backup"
              + key_prefix = "data/"
            }
        }

      ~ server_side_encryption {
          + kms_key_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      - ttl {
          - enabled = false -> null
        }

        # (2 unchanged blocks hidden)
    }

```